# pip3 install transformers
# python3 deepseek_v2_tokenizer.py
import transformers

chat_tokenizer_dir = "./"

tokenizer = transformers.AutoTokenizer.from_pretrained( 
        chat_tokenizer_dir, trust_remote_code=True
        )

MES = """
擬針對LLM RAG(Retrieval-Augmented Generation)應用進行文本chunk切割，用於組建語意向量庫。為了優化檢索效果，切割時儘量保持段落的語意連結整體性，不要切在不適當的地方，避免切出段落太破碎，條列式小點項目放在同一個chunk內。並且在每一個切割出來的chunk前加上該段文字的出處標題及段落標題，以json輸出chunk的清單，不要有其他LLM的說明提詞。在語意主題聚合的前提下，單一chunk以800字左右為目標，區塊長度儘量長，儘量不要漏掉有意義的段落，保持原有標號結構。另去除版權宣告、免責宣告、資格聲明、評級標準、特别声明、投资评级、廣告、娛樂新聞、運動新聞、星座文。
chunk格式範例：
[{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"內政部國土測繪中心",
"background_date":"2022-04-14 00:00:00",
"event_date":"",
"section":"版本資訊及機密等級",
"content": "內政部國土測繪中心\n資訊安全管理系統政策文件\n文件編號：ISMS-01000000\n版 次：V2.95\n文件日期：111年4月14日\n機密等級：普通",
"keywords":["資訊安全管理系統政策文件","內政部國土測繪中心","機密等級"]},
{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"ISMS工作小組",
"background_date":"2010-04-16 00:00:00",
"event_date":"(2007-11-16 00:00:00,2009-12-19 00:00:00)",
"section":"文件制/修訂紀錄",
"content": "文件編號：ISMS-01000000 版次：V2.95\n文件制/修訂紀錄\n版次 日期 說明 作者備註\nV1.0 961116 初版發行 ISMS工作小組\nV2.0 971014 增列「角色及責任」、「人員審查」、「考核獎懲」及「資通安全教育訓練」等事項對應程序文件之說明並配合ISO17799及CNS17799之廢止與ISO27002及CNS27002 之訂頒，修正依據標準。 ISMS工作小組\nV2.1 980213 依據程序文件名稱變更修訂。 ISMS工作小組\nV2.2 1001013 修正ISMS目標及電腦機房名稱。 ISMS工作小組\nV2.3 1031024 1.前言，增加考量組織全景內容。2.修正二~四階程序文件之核定，依100年11月8日簽奉核可知授權人員核定。 蔡汶諭\nV2.4 1041014 文字修正：1.ISO27001標準要求事項第4節至第8節修正為第10節。2.一般要求修正內外部議題與關注方(interested  party)，以及法令、法規及義務之要求。3.事故修正為事件 蔡汶諭\nV2.5 1060213 增加ISMS目標中的機房「電力及空調服務」，核心系統之可用性目標。 陳建男\nV2.6 1061016 增加核心資訊系統等文字 陳建男",
"keywords":["文件制/修訂紀錄","ISMS"]},
{
"type":"RAG chunk",
"title":"1月PMI数据点评：我国经济继续保持平稳恢复态势",
"source":"",
"background_date":"2021-1-1 00:00:00",
"event_date":"(2020-12-21 00:00:00,2021-1-1 00:00:00)",
"section":"拉闸限电制约企业生产",
"content": "1月生产指数为53.5%，环比回落0.7个百分点。采购量下降1.2%至52.0%，但产成品库存指数为49.0%，较上月回升2.8个百分点，原材料库存指数为49.0%，比上月回升0.4个百分点。库存分项均位于临界点下方，表明未来企业生产仍有一定空间。12月中下旬起，湖南、浙江、江西等省份由于气温偏低、年底赶工等导致生活、生产用电需求旺盛，部分地区开启“拉闸限电”。2021年春节较晚，部分地区也提倡就地过年，赶工可能还将持续一段时间，对生产数据造成一定扰动。",
"keywords":["企业生产","拉闸限电","库存指数"]}
]
定出全部段落合適的共用標題放在title，另外section則是各段的副標題。background_date為段落消息發布背景時間，event_date則為該切割段落內提及重要事件的時間，各chunk輸出時間可不同，使用之格式字串表示法為%Y-%m-%d %H:%M:%S，如果時間是一個範圍區間，則使用2維tuple表示該時間區間。另外提供3個重要關鍵字，由重要度高排到低存放於keywords。source則填入消息來源單位。各欄位如無合適值可填入，請填入空字串或空清單。
主檔名為「臺中市西屯區災害應變中心標準作業程序」。
☆輸入文本：幕僚查報組就預防災害應行注意事項通報各里辦公處提高警覺。 
6.1.7 防汛期前依『本區災害變中心幕僚查報組防災整備檢查表』進行檢視，相
關紀錄自行留存備查(詳附件 7.13)。 
6.2 災害緊急應變 
6.2.1 區災害應變中心成立後，里幹事受指揮官之指示應前往轄區派出所，會同
員警搭乘警車，至里辦公處協助里長巡迴轄內，執行災害動態廣播分送緊
急通知書宣導。 
6.2.2 市災害應變中心或區指揮官對危險區域民眾下達勸導性疏散撤離指令時，
配合市災害應變中心，劃定之災害危險區域、土石崩塌地區、野溪危害警
戒管制區域，提供相關資料通報里緊急聯絡人進行疏散、撤離避難措施。 
6.2.3 協同里長對於具有危險潛勢區域，執行勸導撤離，並提供相關災害資訊以
利協助災害警訊廣播作業事項。 
6.2.4 市災害應變中心或區指揮官對危險區域民眾下達強制性疏散撤離指令時，
會知里長或由幕僚查報組，並記錄於「本區撤離人數統計表」，依規定時限
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-3 
回報區災害應變中心(附件 7.6)，協同搶救組、治安交通組指揮警、消、民
政及國軍等單位執行疏散，限制或禁止人民進入或命其離去措施事宜。 
6.2.5 災害發生後，里幹事受指揮官之指示應攜帶必要之勘查作業用具，迅速前
往災害發生地點會同轄區警、消人員，勘查災情類別、受災情形(區域、受
災戶數、人數及設施損壞情形)發生地點等，並填寫災情勘查表(如附件
7.9)，回報幕僚作業人員彙整辦理，並紀錄於災害應變中心大事紀要表(附
件 7.12）中，必要時得由組長或其代理人會同里幹事進行複勘。 
6.2.6 對災害處理應變之程序、過程及指揮官下達之指令，幕僚作業人員應填寫
受理案件管制單(附件 7.7)交受命單位及人員收執，執行完畢後，並應紀錄
於災害應變中心大事紀要表(附件 7.12)中，俾利日後查證以明責任。 
6.3 災後復原 
6.3.1 辦理災損調查時，倘因訪查未遇受災戶，應即填送告知單，以利災損查報
作業(參考附件 7.10)。 
6.3.2 區級災害應變中心撤除後，由幕僚查報組電話或傳真各里辦公處災害警報
解除通報，並載明各相關單位聯絡電話，以利災後各項復建工作聯絡。 
7. 附件 
7.1 臺中市西屯區災害應變中心幕僚查報組作業流程圖。 
7.2 臺中市西屯區公所災害應變中心編組人員輪值簽到、退表。 
7.3 臺中市西屯區公所成立災害應變中心排班輪值表。 
7.4 臺中市西屯區災害應變中心____________災害處理彙報表。 
7.5 臺中市西屯區災情彙計總表。 
7.6 臺中市西屯區撤離人數統計表。 
7.7 臺中市西屯區災害應變中心受理案件管制單。 
7.8 西屯區災害應變中心劃定警戒管制範圍建議申請表。 
7.9 臺中市西屯區災害應變中心幕僚查報組（ ）災情勘查表。 
7.10 災損調查告知單。 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-4 
7.11 臺中市西屯區災害應變中心災情清冊。 
7.12 臺中市西屯區災害應變中心大事紀要表。 
7.13 西屯區災害應變中心幕僚查報組防災整備檢查表。 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-5 
附件 7.1 
臺中市西屯區災害應變中心幕僚查報組作業流程圖
臺北市ＯＯ區災害應變中心勘查組作業流程圖
災害緊急通報
成立區災害應變中心
已發生災情
災情警訊通知災害潛勢
地區住戶
有疏散災害潛勢地區
住戶必要
協助災害潛勢地區住戶或受
災戶疏散至緊急避難所
協助收容組受理登記及
慰問事項
災情勘查
公私有設施損壞
災情查報
善後（復舊）情形查證
回報
結案
NO
YES
協助緊急安置所民眾護
送復原及受災戶救濟事
項
NO
YES
YES
災害特報解除
NO
YES
NO
災害特報解除
NO
YES
風災、疫災等可預
警災害
NO
宣導家戶加強防災措施YES
 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-6 
附件 7.2 
臺中市西屯區公所災害應變中心編組人員輪值簽到、退表 
一、災害名稱： 
二、災害應變中心成立時間： 年 月 日 時 分 
三、災害應變中心成立地點： 
四、編組人員簽到(退) 
組 別 
名 稱 
編 組 
職 稱 
所 屬 
單 位 
姓 名 
簽到(退)時間 
姓 名 
 年 月 日 時 分 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 到 
退 
 
 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-7 
附件7.3 
臺中市西屯區公所成立災害應變中心排班輪值表 
災害名稱：_____________________ 日期_____________-_____________ 
幕僚查報組 
輪值順序 課室/單位 職稱 姓 名 家 中 電 話 手 機 電 話 備註 
1 
2 
3 
4 
5 
6 
7 
8 
9 
10 
 
 
 
 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-8 
附件 7.4 
臺中市西屯區災害應變中心____________災害處理彙報表 
 
年 月 日起至 年 月 日止 第 報 
編號 日期 來電或報案單位 災情（地點、範圍） 處理情形 備考 
001 
002 
003 
004 
005 
006 
007 
008 
009 
010 
011 
註：一、本表每三小時填報乙次，但遇特殊情況，應即時通報。 
二、各單位如發生人員傷亡，應在本表備考欄註明傷亡人員姓名、出生年月日、身分
證字號、地址、傷亡原因、處理情形。 
三、如發生房屋（全倒、半倒）應註明里別、房屋結構、建築面積、處理情形。 
填報單位： 
指揮官： 
填報人： 
傳送時間： 
電話： 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-9 
附件 7.5 
臺中市西屯區災情彙計總表 
年 月 日起至 年 月 日止 第 報 
 
項目災情 總 計 未 處 理 完 畢 數 備 考 
1 路 樹 災 情 
2 廣 告 招 牌 災 情 
3 道 路 、 隧 道 災 情 
4 橋 梁 災 情 
5 鐵路、高鐵捷運災情 
6 積 淹 水 災 情 
7 土 石 災 情 
8 建 物 毀 損 
9 水 利 設 施 災 情 
10 民生、基礎設施災情 
11 車 輛 、 交 通 事 故 
12 環 境 汙 染 
13 火 災 
14 其 他 災 害 
註：一、本表每三小時傳遞乙次，但遇特殊情況應即時通報。 
二、每次災情通報以案件累積方式填列傳遞。 
三、各單位於每次各級災害應變中心撤銷前，應做最後結報，傳遞市應變中心彙報。 
 
指揮官： 填報人： 傳送時間： 
 
 
 
 
 
 
 
 
 
 
 
 
臺中市西屯區災害應變中心作業手冊 幕僚查報組標準作業程序 
1-2-10 
附件 7.6 
臺中市西屯區撤離人數統計表 
填報機關： 災害名稱：____________ 
核定人： 速報時間： 年 月 日 時 分 
速報人： 聯絡電話：(0) __________ (手機) 
速報別：□初報 □續報□結報 
編號 區別 里別 地點 
預計撤
離人數 
實際撤
離人數 
累計撤離
人數 
撤離時間 收容處所 備註 
 
 
 
 
 
 
 
 
 
說明： 
一、「地點」請依執行撤離工作之現地情況酌予補充說明。(如「鄰」、「部落」或「聚
落」等) 
二、「預計撤離人數」：請資料建置單位參考行政院農業委員會「土石流潛勢溪流影響範
圍保全對象清冊」、經濟部「水災危險潛勢地區保全計畫之保全對象」之保全人數，
及撤離範圍內戶籍人口數與常住人口數進行概估填寫。 
三、「實際撤離人數」係指執行勸告撤離及強制撤離人數之合計數，請逐筆填寫各次撤離
人數「新增」統計資料。 
四、「撤離時間」指開始撤離之時間。 
五、「收容處所」請填寫各收容中心內之撤離人數與其他自行安置之人數（例如：○○收容 
 中心 30 人，其他親友/自理 20 人）。 
六、請於「備註」中敘明「預計撤離人數」與「撤離人數」產生差異之實際情況（例如：
受困受災地區○○人，行方不明○○人等）；該區域之居民若不願撤離，必須動用公權力
「強制撤離」者，並請於備註欄註明強制撤離人數。 
七、原則上每隔 3 小時填送(3、6、9、12、15、18、21、24 時)；惟遇有撤離人數增加較多
時，請即時填送並以電話先行聯繫，以利彙報。 
八、「核定人」欄係由單位該時段進駐災害應變中心最高職級者或其職務代理人簽章
（名）。 
臺中市西屯區災害應變中心作業手冊 幕
回答時以json輸出chunk的清單，chunk數量無限制，不要有其他LLM的說明提詞。
"""
RAG_CHUNK_Rule = """
擬針對LLM RAG(Retrieval-Augmented Generation)應用進行文本chunk切割，用於組建語意向量庫。為了優化檢索效果，切割時儘量保持段落的語意連結整體性，不要切在不適當的地方，避免切出段落太破碎，條列式小點項目放在同一個chunk內。並且在每一個切割出來的chunk前加上該段文字的出處標題及段落標題，以json輸出chunk的清單，不要有其他LLM的說明提詞。在語意主題聚合的前提下，單一chunk以800字左右為目標，區塊長度儘量長，儘量不要漏掉有意義的段落，保持原有標號結構。另去除版權宣告、免責宣告、資格聲明、評級標準、特别声明、投资评级、廣告、娛樂新聞、運動新聞、星座文。
chunk格式範例：
[{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"內政部國土測繪中心",
"background_date":"2022-04-14 00:00:00",
"event_date":"",
"section":"版本資訊及機密等級",
"content": "內政部國土測繪中心\n資訊安全管理系統政策文件\n文件編號：ISMS-01000000\n版 次：V2.95\n文件日期：111年4月14日\n機密等級：普通",
"keywords":["資訊安全管理系統政策文件","內政部國土測繪中心","機密等級"]},
{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"ISMS工作小組",
"background_date":"2010-04-16 00:00:00",
"event_date":"(2007-11-16 00:00:00,2009-12-19 00:00:00)",
"section":"文件制/修訂紀錄",
"content": "文件編號：ISMS-01000000 版次：V2.95\n文件制/修訂紀錄\n版次 日期 說明 作者備註\nV1.0 961116 初版發行 ISMS工作小組\nV2.0 971014 增列「角色及責任」、「人員審查」、「考核獎懲」及「資通安全教育訓練」等事項對應程序文件之說明並配合ISO17799及CNS17799之廢止與ISO27002及CNS27002 之訂頒，修正依據標準。 ISMS工作小組\nV2.1 980213 依據程序文件名稱變更修訂。 ISMS工作小組\nV2.2 1001013 修正ISMS目標及電腦機房名稱。 ISMS工作小組\nV2.3 1031024 1.前言，增加考量組織全景內容。2.修正二~四階程序文件之核定，依100年11月8日簽奉核可知授權人員核定。 蔡汶諭\nV2.4 1041014 文字修正：1.ISO27001標準要求事項第4節至第8節修正為第10節。2.一般要求修正內外部議題與關注方(interested  party)，以及法令、法規及義務之要求。3.事故修正為事件 蔡汶諭\nV2.5 1060213 增加ISMS目標中的機房「電力及空調服務」，核心系統之可用性目標。 陳建男\nV2.6 1061016 增加核心資訊系統等文字 陳建男",
"keywords":["文件制/修訂紀錄","ISMS"]},
{
"type":"RAG chunk",
"title":"1月PMI数据点评：我国经济继续保持平稳恢复态势",
"source":"",
"background_date":"2021-1-1 00:00:00",
"event_date":"(2020-12-21 00:00:00,2021-1-1 00:00:00)",
"section":"拉闸限电制约企业生产",
"content": "1月生产指数为53.5%，环比回落0.7个百分点。采购量下降1.2%至52.0%，但产成品库存指数为49.0%，较上月回升2.8个百分点，原材料库存指数为49.0%，比上月回升0.4个百分点。库存分项均位于临界点下方，表明未来企业生产仍有一定空间。12月中下旬起，湖南、浙江、江西等省份由于气温偏低、年底赶工等导致生活、生产用电需求旺盛，部分地区开启“拉闸限电”。2021年春节较晚，部分地区也提倡就地过年，赶工可能还将持续一段时间，对生产数据造成一定扰动。",
"keywords":["企业生产","拉闸限电","库存指数"]}
]
定出全部段落合適的共用標題放在title，另外section則是各段的副標題。background_date為段落消息發布背景時間，event_date則為該切割段落內提及重要事件的時間，各chunk輸出時間可不同，使用之格式字串表示法為%Y-%m-%d %H:%M:%S，如果時間是一個範圍區間，則使用2維tuple表示該時間區間。另外提供3個重要關鍵字，由重要度高排到低存放於keywords。source則填入消息來源單位。各欄位如無合適值可填入，請填入空字串或空清單。
主檔名為「
"""
MDTMES = """

請萃取下列文本中有關軍事、外交、科技、政治、經濟、社會、機關單位領域的詞彙，如果該詞彙的某個片段也是有意義的子詞彙，則一併提取，提取原則為越多越好。輸出格式為 json 格式，以繁體中文取代簡體中文輸出。

輸出格式要求：
每個詞彙的資訊以 JSON 物件表示，包含以下欄位：
main_term：文本中出現的詞彙用字，如果中英文翻譯共同出現，優先採用中文。
formal_name_china：詞彙的中國大陸用語正式全稱，。
formal_name_taiwan：詞彙的臺灣用語正式全稱。
formal_name_en：詞彙的英文正式全稱。
field：詞彙所屬領域（例如軍事、外交、科技）。
semantic_components：main_term、formal_name_zh_cn、formal_name_zh_tw這三個屬性中有意義片段構成的子詞彙。
abbreviations_zh：main_term的中文縮寫清單。
definition：詞彙的定義或解釋。
context：詞彙在輸入文本中的上下文。
article_title：輸入任務文本的有意義標題。
article_code：輸入任務文本的文件編號或期數編號。
article_proceeding：輸入任務文本的出處刊名。
如果某個欄位沒有合適的值，請留空。
參考輸出範例：
[
{
"main_term": "武器裝備體系",
"formal_name_china": "武器裝備體系",
"formal_name_taiwan": "武器裝備體系",
"formal_name_en": "Weapon Equipment System",
"field": ["軍事"],
"semantic_components": ["武器", "裝備體系", "裝備", "體系"],
"abbreviations_zh": ["武裝體系","軍備體系","裝備體系"],
"definition": "指用於軍事目的的各種武器和相關裝備的組合。",
"context": "在現代戰爭中，武器裝備體系的完善與否直接影響戰鬥力。",
},
{
"main_term": "北約",
"formal_name_china": "北大西洋公約組織",
"formal_name_taiwan": "北大西洋公約組織",
"formal_name_en": "North Atlantic Treaty Organization",
"field": ["外交"],
"semantic_components": ["北大西洋", "公約組織"],
"abbreviations_zh": ["北約"],
"definition": "由北美和歐洲國家組成的軍事同盟。",
"context": "北約近期舉行了年度軍事演習。",
},
{
"main_term": "太空人",
"formal_name_china": "航天員",
"formal_name_taiwan": "太空人",
"formal_name_en": "Astronaut",
"field": ["科技"],
"semantic_components": ["太空", "航天"],
"abbreviations_zh": ["太空人"],
"definition": "太空人是指接受航太訓練後，指揮、操縱或搭乘太空載具的人員。",
"context": "自1961年人類首次飛天以來，共有來自64個國家的太空人先後飛天。",
},
]

注意事項：
-範例僅供格式參考，如果範例中的詞彙未出現在輸入文本中，請勿將其加入輸出。
確保輸出格式嚴格符合 JSON 規範。
-main_term 原則上是一個詞彙，避免中文及該詞的英文翻譯並列，如果都有出現，選擇中文詞彙。
-main_term 是文本中出現的詞彙（可能是簡稱或上下文用詞），而 formal_name_zh_cn及formal_name_zh_tw 是該詞彙的中文正式全稱，三者不一定相同。
-semantic_components的部份，要對main_term、formal_name_zh_cn、formal_name_zh_tw三個屬性都做分析。
-只要輸出JSON格式就好，不要有其他說明。
主檔名為「中国人民解放军军语_1982版_OCR_2-845」，可用於輔助分析article_title。
☆下列為輸入任務文本： 工 作
我军的性质 ……… … … … 1 75 政治工作三大原则 … · . . · • · 1 76 
我军的宗旨 …… … … … … 1 75 官兵一致 · …… ·………… · 1 76 
军队政治工作 •.. .……… · � • 1 75 军民一致 ………………… l 76
思想工作（思想教育工 瓦解敌军 …… … … … … · · · 1 76 
作） · · ., · · · · · · · • · · · • · · · · · · • • • • • · 1 75 尊干爱兵 ． ． ． ． ． ． ． ． ． ． ． ． ． ． ． ． ． ． ． 一 · • 1 76 
军事训练中 的政治工作 … 1 75 拥政爱民 … … … … … …… 1 76
军队政治机关 … …．……… 1 76 拥政爱民月 … … … … …… 177
(3.4 ) 词 目表
拥军优属 .. …·……·… ·…· 1 77 政治教育 .. ….. . . . .… . .…·• 18 1 
三大民主 ………………… 1 77· 阶级觉悟（政治觉悟）…… 18 1
/no_think
"""
#MES = RAG_CHUNK_Rule+"\n主檔名為「\n"
MES = MDTMES
result = tokenizer.encode(MES)
print(result)
print(len(result))
print("len(result) % 64:",len(result) % 64)
