# pip3 install transformers
# python3 deepseek_v2_tokenizer.py
import transformers

chat_tokenizer_dir = "./"

tokenizer = transformers.AutoTokenizer.from_pretrained( 
        chat_tokenizer_dir, trust_remote_code=True
        )

MES = """
擬針對LLM RAG(Retrieval-Augmented Generation)應用進行文本chunk切割，用於組建語意向量庫。為了優化檢索效果，切割時儘量保持段落的語意連結整體性，不要切在不適當的地方，避免切出段落太破碎，條列式小點項目放在同一個chunk內。並且在每一個切割出來的chunk前加上該段文字的出處標題及段落標題，以json輸出chunk的清單，不要有其他LLM的說明提詞。在語意主題聚合的前提下，單一chunk以800字左右為目標，區塊長度儘量長，儘量不要漏掉有意義的段落，保持原有標號結構。另去除版權宣告、免責宣告、資格聲明、評級標準、特别声明、投资评级、廣告、娛樂新聞、運動新聞、星座文。
chunk格式範例：
[{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"內政部國土測繪中心",
"background_date":"2022-04-14 00:00:00",
"event_date":"",
"section":"版本資訊及機密等級",
"content": "內政部國土測繪中心\n資訊安全管理系統政策文件\n文件編號：ISMS-01000000\n版 次：V2.95\n文件日期：111年4月14日\n機密等級：普通",
"keywords":["資訊安全管理系統政策文件","內政部國土測繪中心","機密等級"]},
{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"ISMS工作小組",
"background_date":"2010-04-16 00:00:00",
"event_date":"(2007-11-16 00:00:00,2009-12-19 00:00:00)",
"section":"文件制/修訂紀錄",
"content": "文件編號：ISMS-01000000 版次：V2.95\n文件制/修訂紀錄\n版次 日期 說明 作者備註\nV1.0 961116 初版發行 ISMS工作小組\nV2.0 971014 增列「角色及責任」、「人員審查」、「考核獎懲」及「資通安全教育訓練」等事項對應程序文件之說明並配合ISO17799及CNS17799之廢止與ISO27002及CNS27002 之訂頒，修正依據標準。 ISMS工作小組\nV2.1 980213 依據程序文件名稱變更修訂。 ISMS工作小組\nV2.2 1001013 修正ISMS目標及電腦機房名稱。 ISMS工作小組\nV2.3 1031024 1.前言，增加考量組織全景內容。2.修正二~四階程序文件之核定，依100年11月8日簽奉核可知授權人員核定。 蔡汶諭\nV2.4 1041014 文字修正：1.ISO27001標準要求事項第4節至第8節修正為第10節。2.一般要求修正內外部議題與關注方(interested  party)，以及法令、法規及義務之要求。3.事故修正為事件 蔡汶諭\nV2.5 1060213 增加ISMS目標中的機房「電力及空調服務」，核心系統之可用性目標。 陳建男\nV2.6 1061016 增加核心資訊系統等文字 陳建男",
"keywords":["文件制/修訂紀錄","ISMS"]},
{
"type":"RAG chunk",
"title":"1月PMI数据点评：我国经济继续保持平稳恢复态势",
"source":"",
"background_date":"2021-1-1 00:00:00",
"event_date":"(2020-12-21 00:00:00,2021-1-1 00:00:00)",
"section":"拉闸限电制约企业生产",
"content": "1月生产指数为53.5%，环比回落0.7个百分点。采购量下降1.2%至52.0%，但产成品库存指数为49.0%，较上月回升2.8个百分点，原材料库存指数为49.0%，比上月回升0.4个百分点。库存分项均位于临界点下方，表明未来企业生产仍有一定空间。12月中下旬起，湖南、浙江、江西等省份由于气温偏低、年底赶工等导致生活、生产用电需求旺盛，部分地区开启“拉闸限电”。2021年春节较晚，部分地区也提倡就地过年，赶工可能还将持续一段时间，对生产数据造成一定扰动。",
"keywords":["企业生产","拉闸限电","库存指数"]}
]
定出全部段落合適的共用標題放在title，另外section則是各段的副標題。background_date為段落消息發布背景時間，event_date則為該切割段落內提及重要事件的時間，各chunk輸出時間可不同，使用之格式字串表示法為%Y-%m-%d %H:%M:%S，如果時間是一個範圍區間，則使用2維tuple表示該時間區間。另外提供3個重要關鍵字，由重要度高排到低存放於keywords。source則填入消息來源單位。各欄位如無合適值可填入，請填入空字串或空清單。
主檔名為「臺中市西屯區災害應變中心標準作業程序」。
☆輸入文本：
(3)臺中市西屯區災害應變中心標準作業程序
核定時間：112年 11月 13日 
核定文號：公所民字第 1120034140 號 
版次資訊：第四版 
修訂沿革：106年 10月 2日經西屯區災害防救會報 
(公所民字第 1060029975 號函)修正第ㄧ版 
 108年 10月 31日經西屯區災害防救會報 
(公所民字第 1080032244 號函)修正第二版 
110年 11月 26日經西屯區災害防救會報 
(公所民字第 1100033064 號函)修正第三版 
承辦人資訊 
姓名：黃郁芳 
單位：臺中市西屯區公所民政課 
地址：40755 臺中市西屯區市政北二路 386號 
電話：04-22556333 
傳真：04-22552871 
電子信箱：tccght3057@taichung.gov.tw 
臺中市西屯區災害應變作業手冊 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
西屯區災害應變作業手冊 
目錄 
災害應變中心作業手冊 
災害應變中心標準作業程序 ··············································································· 1-1-1 
幕僚查報組標準作業程序 ··················································································· 1-2-1 
搶修組標準作業程序 ··························································································· 1-3-1 
收容救濟組標準作業程序 ··················································································· 1-4-1 
總務組標準作業程序 ··························································································· 1-5-1 
搶救組標準作業程序 ··························································································· 1-6-1 
治安交通組標準作業程序 ··················································································· 1-7-1 
醫護組標準作業程序 ··························································································· 1-8-1 
環保組標準作業程序 ··························································································· 1-9-1 
維生管線組標準作業程序 ··················································································· 1-10-1 
防救災任務標準作業程序 
前進指揮所開設作業要點 ··················································································· 2-1-1 
防汛沙包發放及回收作業要點 ··········································································· 2-2-1 
封橋封路標準作業程序 ······················································································· 2-3-1 
車行地下道封閉標準作業程序 ··········································································· 2-4-1 
水災疏散撤離標準作業程序 ··············································································· 2-5-1 
緊急災民收容中心標準作業程序 ······································································· 2-6-1 
臨時避難收容處所開設及管理注意事項 ··························································· 2-7-1 
臨時避難收容處所設置作業要點 ······································································· 2-8-1 
緊急救濟糧食及民生用品儲存作業要點 ··························································· 2-9-1 
災害救助物資管理標準作業程序 ······································································· 2-10-1 
國軍協助災害防救辦法 ······················································································· 2-11-1 
重大災害罹難者遺體處理作業要點 ··································································· 2-12-1 
災害救助金核發辦法 ··························································································· 2-13-1 
急難救助辦法 ······································································································· 2-14-1 
轄管學校作為災害避難收容處所管理計畫 ······················································· 2-15-1 
居家身心障礙者使用維生器材斷電應變機制 ··················································· 2-16-1 
 
 
 
 
 
 
 
 
 
臺中市西屯區災害應變中心 
標準作業程序 
 
 
中華民國 106 年 10 月 2 日 
公所民字第 1060029975 號函定稿 
中華民國 108 年 10 月 31 日 
公所民字第 1080032244 號函修正第二版 
中華民國 110 年 11 月 26 日 
公所民字第 1100033064 號函修正第三版 
中華民國 112 年 11 月 13 日 
公所民字第 1120034140 號函修正第四版 
 
 
 
 
 
臺中市西屯區災害應變中心作業手冊 災害應變中心標準作業程序 
1-1-1 
西屯區災害應變中心標準作業程序 
1. 目的 
本作業之手冊在於建構完善之災害通報系統與健全緊急應變體系，俾迅速掌握災害狀
況，即時通報傳遞災情並指揮、聯繫、協調相關單位處理災害搶救事宜，運用各項防
救災資源，期將災害影響降至最低。 
2. 適用範圍 
本作業程序適用於本區災害應變中心相關作業。 
3. 參考資料 
3.1 災害防救法。 
3.2 臺中市地區災害防救計畫。 
3.3 臺中市區級災害應變中心作業要點。 
3.4 臺中市西屯區地區災害防救計畫。 
3.5 臺中市災害應變中心作業要點。 
4. 權責單位 
西屯區災害應變中心編組人員。 
5. 任務分工事項 
5.1 加強災害防救相關機關之縱向指揮、督導及橫向協調、聯繫事宜，處理各項災害
應變措施。 
5.2 掌握各種災害狀況，即時傳遞災情，並通報相關單位應變處理。 
5.3 災情之蒐集、評估、處理、彙整、管制及報告事項。 
5.4 緊急救災人力、物資之調度、支援事項。 
5.5 其他有關防救災事項。 
6. 作業程序 
6.1 災前整備 
6.1.1 接獲成立區級災害應變中心指令，即透過一呼百應系統通知編組人員，依
規定通知時間內到達災害應變中心完成進駐作業。 
臺中市西屯區災害應變中心作業手冊 災害應變中心標準作業程序 
1-1-2 
6.1.2 發生重大災害或有發生之虞時，得以書面或口頭報告市長即時成立該區災
害應變中心，並於三日內補提書面報告，並完成「災害應變中心開設通報
單」。 
6.1.3 由區長兼任指揮官，副區長、主任秘書兼任副指揮官，受市級災害應變中
心之指揮，執行區內重大災害應變事宜，指揮官不在或未到達前，代理順
序為副區長、主任秘書、民政課課長。 
6.1.4 因地震或其它災害發生，致本市電信通訊、電力中斷時，區級災害應變中
心人員應不待通知，主動到達災害應變中心完成進駐，展開各項緊急應變
措施。 
6.1.5 各編組組長應攜帶動員人力、機具表報到（如於夜間或假日成立，於報到
時填寫）。 
6.1.6 完成應變中心場地佈置。 
6.1.7 召開防災整備會議。災害類型分析及災情研判報告（幕僚查報組） 
6.1.8 指揮官於整備會議，各組組長報告：人員、裝備、機具、資源整備情形。
並依實際需要，進入待命。 
6.1.9 指揮官指（裁）示。 
6.2 災害緊急應變 
6.2.1 搶救組透過警察分局及消防勤務指揮系統，蒐集災情，隨時回報轄區內受
災情況及搶救工作進度。 
6.2.2 指揮官及相關人員因災情勘查需要之交通工具，由公所訂立開口契約調度
提供，不足部分則請警察分局、消防分隊協助提供；另請消防局、警察分
局分別提供警用無線電乙具，供勘、救災指揮調度使用。 
6.2.3 遇重大災情發生，請指揮官商請國軍支援，以利執行勘、救災指揮調度工
作。 
臺中市西屯區災害應變中心作業手冊 災害應變中心標準作業程序 
1-1-3 
6.2.4 區級災害應變中心無法因應災害規模時，應向市級災害應變中心請求支
援，該災害防救業務主管機關應向市級災害應變中心指揮官報核後，依相
關規定向中央災害應變中心請求支援協助。 
6.2.5 災害應變中心應有固定作業場所，設置傳真、聯絡電話及相關必要設備，
指定二十四小時聯繫待命人員，受理電話及傳真通報，對於突發狀況，立
即反映與處理。 
6.2.6 災害應變中心應於災害發生或有發生之虞時即行運作，主動互相聯繫協調
通報，並執行災情蒐集、查證、彙整、通報、災害搶救及救災資源調度等
緊急措施。 
6.3 災害應變處理： 
6.3.1 接獲災情通報，幕僚查報組應立即填報災害緊急通報記錄表陳核，並同步
交由任務權責編組人員憑辦及通報市級災害應變中心彙整。 
6.3.2 各組除依據通報表轉請權責單位立即處理外，另將處理情形填具大事紀要
表陳核，以利查考。 
6.3.3 轄內可能發生重大災害易生危險之地區，於災害應變之必要範圍內，由治
安交通組提出劃定管制區域及管制時間建議，並向市級災害應變中心通
報。 
6.3.4 針對時間急迫之救災、救難、救護、緊急災變搶救支援，非經空中運送，
將影響緊急醫療救護時效等人力無法達到救援目的之災難，由市級災害應
變中心直接以電話或傳真申請表，向行政院國家搜救中心提出空中救援申
回答時以json輸出chunk的清單，不要有其他LLM的說明提詞。
"""
RAG_CHUNK_Rule = """
擬針對LLM RAG(Retrieval-Augmented Generation)應用進行文本chunk切割，用於組建語意向量庫。為了優化檢索效果，切割時儘量保持段落的語意連結整體性，不要切在不適當的地方，避免切出段落太破碎，條列式小點項目放在同一個chunk內。並且在每一個切割出來的chunk前加上該段文字的出處標題及段落標題，以json輸出chunk的清單，不要有其他LLM的說明提詞。在語意主題聚合的前提下，單一chunk以800字左右為目標，區塊長度儘量長，儘量不要漏掉有意義的段落，保持原有標號結構。另去除版權宣告、免責宣告、資格聲明、評級標準、特别声明、投资评级、廣告、娛樂新聞、運動新聞、星座文。
chunk格式範例：
[{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"內政部國土測繪中心",
"background_date":"2022-04-14 00:00:00",
"event_date":"",
"section":"版本資訊及機密等級",
"content": "內政部國土測繪中心\n資訊安全管理系統政策文件\n文件編號：ISMS-01000000\n版 次：V2.95\n文件日期：111年4月14日\n機密等級：普通",
"keywords":["資訊安全管理系統政策文件","內政部國土測繪中心","機密等級"]},
{
"type":"RAG chunk",
"title":"資訊安全管理系統政策文件",
"source":"ISMS工作小組",
"background_date":"2010-04-16 00:00:00",
"event_date":"(2007-11-16 00:00:00,2009-12-19 00:00:00)",
"section":"文件制/修訂紀錄",
"content": "文件編號：ISMS-01000000 版次：V2.95\n文件制/修訂紀錄\n版次 日期 說明 作者備註\nV1.0 961116 初版發行 ISMS工作小組\nV2.0 971014 增列「角色及責任」、「人員審查」、「考核獎懲」及「資通安全教育訓練」等事項對應程序文件之說明並配合ISO17799及CNS17799之廢止與ISO27002及CNS27002 之訂頒，修正依據標準。 ISMS工作小組\nV2.1 980213 依據程序文件名稱變更修訂。 ISMS工作小組\nV2.2 1001013 修正ISMS目標及電腦機房名稱。 ISMS工作小組\nV2.3 1031024 1.前言，增加考量組織全景內容。2.修正二~四階程序文件之核定，依100年11月8日簽奉核可知授權人員核定。 蔡汶諭\nV2.4 1041014 文字修正：1.ISO27001標準要求事項第4節至第8節修正為第10節。2.一般要求修正內外部議題與關注方(interested  party)，以及法令、法規及義務之要求。3.事故修正為事件 蔡汶諭\nV2.5 1060213 增加ISMS目標中的機房「電力及空調服務」，核心系統之可用性目標。 陳建男\nV2.6 1061016 增加核心資訊系統等文字 陳建男",
"keywords":["文件制/修訂紀錄","ISMS"]},
{
"type":"RAG chunk",
"title":"1月PMI数据点评：我国经济继续保持平稳恢复态势",
"source":"",
"background_date":"2021-1-1 00:00:00",
"event_date":"(2020-12-21 00:00:00,2021-1-1 00:00:00)",
"section":"拉闸限电制约企业生产",
"content": "1月生产指数为53.5%，环比回落0.7个百分点。采购量下降1.2%至52.0%，但产成品库存指数为49.0%，较上月回升2.8个百分点，原材料库存指数为49.0%，比上月回升0.4个百分点。库存分项均位于临界点下方，表明未来企业生产仍有一定空间。12月中下旬起，湖南、浙江、江西等省份由于气温偏低、年底赶工等导致生活、生产用电需求旺盛，部分地区开启“拉闸限电”。2021年春节较晚，部分地区也提倡就地过年，赶工可能还将持续一段时间，对生产数据造成一定扰动。",
"keywords":["企业生产","拉闸限电","库存指数"]}
]
定出全部段落合適的共用標題放在title，另外section則是各段的副標題。background_date為段落消息發布背景時間，event_date則為該切割段落內提及重要事件的時間，各chunk輸出時間可不同，使用之格式字串表示法為%Y-%m-%d %H:%M:%S，如果時間是一個範圍區間，則使用2維tuple表示該時間區間。另外提供3個重要關鍵字，由重要度高排到低存放於keywords。source則填入消息來源單位。各欄位如無合適值可填入，請填入空字串或空清單。
主檔名為「
"""
#MES = RAG_CHUNK_Rule+"\n主檔名為「\n"
result = tokenizer.encode(MES)
print(result)
print(len(result))
print("len(result) % 64:",len(result) % 64)
